call-with-current-continuation
=================================================
Синтаксис
---------------------------------------------------------
```
(call-with-current-continuation proc)
```
proc - процедура с одним параметром: (proc cont).
 Параметр процедуры proc - это продолжение (continuation, "континуация") cont.
 cont может быть применена как процедура с одним аргументом.
 
Cематика
---------------------------------------------------------
Далее для краткости будет **call/cc** вместо **call-with-current-continuation**.
```
(define call/cc call-with-current-continuation)
```
Процедура **call/cc** создаёт объект продолжения из точки своего применения и к этому объекту применяет свой аргумент.
 Если примененная процедура ничего не делает со своим аргументом, то её возврвщвемое значение становится возвращаемым значением вызова **call/cc**.

КАРТИНКА


Применение продолжения
---------------------------------------------------------

Стек, предшествующий применению продолжения, отбрасывается, восстанавливается стек, сохранённый в продолжении. 

КАРТИНКА

 ```
(define (prod-rec xs c)
  (cond
    ((null? xs) 1)
    ((= (car xs) 0) (c 0))
    (else (* (car xs)
             (prod-rec (cdr xs) c)))))
             
(define (prod xs)
  (call/сc
   (lambla (c)
           (prod-reс xs c))))
```

КАРТИНКА
#  ⇩  ➪

КАРТИНКА
